{"Calendar": "The Calendar integration enables users to efficiently manage their calendar events. With this integration, users can create new events, update details of existing events, delete events they no longer need, and search for specific events within their calendar. This comprehensive set of tools supports all the core functionalities required for personal or professional calendar management.", "Files": "This integration with the \"Files\" app enables users to perform core file management tasks. Users can create new files, update the contents or properties of existing files, and move files to the trash for deletion or later recovery. This functionality supports efficient organization and maintenance of files within the application.", "FaceTime": "This integration allows users to start a FaceTime call directly from the platform. By using the \"start_call\" tool, users can initiate a FaceTime video or audio call with their contacts, streamlining the process of connecting via FaceTime without needing to switch applications.", "Mail": "This integration connects with the Mail application, enabling users to send emails directly and search for specific emails within their inbox. With these tools, users can efficiently manage their email communications by composing and sending new messages as well as locating existing emails based on search criteria.", "Maps": "This integration with Maps enables users to search for locations and obtain directions. Users can look up specific places or addresses using the \"search_location\" tool, and get step-by-step navigation instructions to a chosen destination with the \"get_directions\" tool. This functionality supports efficient travel planning and easy discovery of locations on the map.", "Music": "This integration with the Music app allows users to search the music library for specific songs, artists, or albums, and to play selected songs directly from the library. Users can quickly find and listen to their favorite tracks using the provided search and playback functionalities.", "Messages": "This integration with the \"Messages\" app enables users to send new messages and search through their existing messages. Users can compose and deliver messages directly from the integration, as well as efficiently find past messages using search functionality. This supports streamlined communication and easy access to message history within the app.", "Notes": "This integration with the Notes app enables users to create new notes and update existing ones. Users can quickly jot down new information or edit their current notes, making it easy to keep their notes organized and up to date.", "Reminders": "The Reminders integration enables users to manage their reminders directly. Users can create new reminders for tasks or events and update existing reminders to change details such as time, date, or description. This integration streamlines the process of keeping track of important activities and ensures that reminders are always up to date.", "Slack": "This integration enables users to send messages to Slack. With the \"send_message\" tool, you can automate the process of posting messages to Slack channels or direct messages, making it easier to keep teams informed or trigger notifications based on events in other systems.", "System": "This integration enables the ability to capture screenshots of the current screen. Users can utilize the \"capture_screenshot\" tool to quickly and easily take a snapshot of whatever is currently displayed, which can then be used for documentation, sharing, or support purposes.", "Stocks": "The Stocks integration allows users to find stock symbol information using the \"find_symbol\" tool. This functionality helps users quickly look up and identify the correct ticker symbols for various stocks, making it easier to research or track equities in the market.", "WebBrowser": "This integration enables users to open URLs directly in a web browser. By using the \"open_url\" tool, users can quickly access any web page by specifying its URL, streamlining the process of browsing the internet from within the integrated environment.", "Weather": "The Weather integration enables applications to access up-to-date weather information for any specified location using the \"get_weather\" tool. This functionality supports retrieving current weather conditions, forecasts, and other relevant meteorological data, making it suitable for apps or services that require weather updates for user-specified locations.", "Misc": "This integration supports direct message replies to users and can notify users when a requested task is unachievable with the current toolset. It is suitable for basic conversational scenarios and for providing clear feedback when limitations are encountered."}